zhanghaofanarbin/stm32/User/BSP/inc/bsp_usart_dma.h
#ifndef __USART_DMA_H
#define __USART_DMA_H
#include "stm32f4xx.h"

#define DEBUG_USART                             USART1
#define DEBUG_USART_CLK                         RCC_APB2Periph_USART1
#define DEBUG_USART_BAUDRATE                    115200  //串口波特率

#define DEBUG_USART_RX_GPIO_PORT                GPIOA
#define DEBUG_USART_RX_GPIO_CLK                 RCC_AHB1Periph_GPIOA
#define DEBUG_USART_RX_PIN                      GPIO_Pin_10
#define DEBUG_USART_RX_AF                       GPIO_AF_USART1
#define DEBUG_USART_RX_SOURCE                   GPIO_PinSource10

#define DEBUG_USART_TX_GPIO_PORT                GPIOA
#define DEBUG_USART_TX_GPIO_CLK                 RCC_AHB1Periph_GPIOA
#define DEBUG_USART_TX_PIN                      GPIO_Pin_9
#define DEBUG_USART_TX_AF                       GPIO_AF_USART1
#define DEBUG_USART_TX_SOURCE                   GPIO_PinSource9

#define DEBUG_USART_IRQHandler                  USART1_IRQHandler
#define DEBUG_USART_IRQ                 				USART1_IRQn

/************************************************************/
#define Send
#define BUFFERSIZE                              5000
#define DMA_USART1_STREAM                       DMA2_Stream7
#define DMA_USART1_CLK                          RCC_AHB1Periph_DMA2
#define DMA_USART1_CHANNEL                      DMA_Channel_4
#define DMA_USART1_BASEADDR                     (USART1_BASE+0X04)  //__IO uint16_t DR;         /*!< USART Data register,                     Address offset: 0x04 */

void Debug_DMA_USART_Config(void);
void USART_Config(void);
//void Usart_SendByte( USART_TypeDef * pUSARTx, uint8_t ch);
//void Usart_SendString( USART_TypeDef * pUSARTx, char *str);
//void Usart_SendHalfWord( USART_TypeDef * pUSARTx, uint16_t ch);

#endif